Note/PrimeFactorization.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-24 周一 17:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prime Factorization</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Comcx" />
<link rel="stylesheet" type="text/css" href="org-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="org-themes/styles/readtheorg/css/readtheorg.css"/>
<link rel="icon" type="image/x-icon" href="../images/digimon-icon.png" />
</head>
<body>
<div id="content">
<h1 class="title">Prime Factorization</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org541239d">1. Description of the kata</a></li>
<li><a href="#orgcfebbbb">2. Solution in Scala</a>
<ul>
<li><a href="#org8f0b19f">2.1. Imperative version</a></li>
<li><a href="#org7c0beb2">2.2. Moving forward</a></li>
</ul>
</li>
<li><a href="#orgdd34a4e">3. Generating list of primes</a>
<ul>
<li><a href="#orgb31f17c">3.1. A puzzle</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
I suddenly wondered that what's the best way to do <span class="underline">prime factorization</span>.
</p>

<p>
Looking back on old katas in codewars, I found the kata: <a href="https://www.codewars.com/kata/54d512e62a5e54c96200019e/">Primes in Numbers</a>.
</p>

<div id="outline-container-org541239d" class="outline-2">
<h2 id="org541239d"><span class="section-number-2">1</span> Description of the kata</h2>
<div class="outline-text-2" id="text-1">
<p>
Given a positive number n &gt; 1 find the prime factor decomposition of n. The result will be a string with the following form :
</p>
<pre class="example">
 "(p1**n1)(p2**n2)...(pk**nk)"
</pre>
<p>
with the p(i) in increasing order and n(i) empty if n(i) is 1.
</p>

<pre class="example">
Example: n = 86240 should return "(2**5)(5)(7**2)(11)"
</pre>
</div>
</div>

<div id="outline-container-orgcfebbbb" class="outline-2">
<h2 id="orgcfebbbb"><span class="section-number-2">2</span> Solution in Scala</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org8f0b19f" class="outline-3">
<h3 id="org8f0b19f"><span class="section-number-3">2.1</span> Imperative version</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #729fcf; font-weight: bold;">object</span> <span style="color: #8ae234; font-weight: bold;">PrimeDecomp</span> <span style="color: #ffd700;">{</span>

  <span style="color: #729fcf; font-weight: bold;">def</span> <span style="color: #edd400; font-weight: bold;">isPrime</span><span style="color: #00bfff;">(</span>n<span style="color: #729fcf; font-weight: bold;">:</span> <span style="color: #8ae234; font-weight: bold;">Int</span><span style="color: #00bfff;">)</span><span style="color: #729fcf; font-weight: bold;">:</span> <span style="color: #8ae234; font-weight: bold;">Boolean</span> <span style="color: #729fcf; font-weight: bold;">=</span> <span style="color: #00bfff;">{</span>
    <span style="color: #729fcf; font-weight: bold;">if</span> <span style="color: #ffa500;">(</span>n == <span style="color: #8ae234; font-weight: bold;">2</span><span style="color: #ffa500;">)</span> <span style="color: #8ae234; font-weight: bold;">true</span>
    <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">if</span> <span style="color: #ffa500;">(</span>n &lt; <span style="color: #8ae234; font-weight: bold;">2</span> || n % <span style="color: #8ae234; font-weight: bold;">2</span> == <span style="color: #8ae234; font-weight: bold;">0</span><span style="color: #ffa500;">)</span> <span style="color: #8ae234; font-weight: bold;">false</span>
    <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #8ae234; font-weight: bold;">Stream</span>.from<span style="color: #ffa500;">(</span><span style="color: #8ae234; font-weight: bold;">3</span>, <span style="color: #8ae234; font-weight: bold;">2</span><span style="color: #ffa500;">)</span>.takeWhile<span style="color: #ffa500;">(</span>i <span style="color: #729fcf; font-weight: bold;">=&gt;</span> i * i &lt; n + <span style="color: #8ae234; font-weight: bold;">1</span><span style="color: #ffa500;">)</span>.forall<span style="color: #ffa500;">(</span>i <span style="color: #729fcf; font-weight: bold;">=&gt;</span> n % i != <span style="color: #8ae234; font-weight: bold;">0</span><span style="color: #ffa500;">)</span>
  <span style="color: #00bfff;">}</span>
  <span style="color: #729fcf; font-weight: bold;">def</span> <span style="color: #edd400; font-weight: bold;">factors</span><span style="color: #00bfff;">(</span>m<span style="color: #729fcf; font-weight: bold;">:</span> <span style="color: #8ae234; font-weight: bold;">Int</span><span style="color: #00bfff;">)</span><span style="color: #729fcf; font-weight: bold;">:</span> <span style="color: #8ae234; font-weight: bold;">String</span> <span style="color: #729fcf; font-weight: bold;">=</span> <span style="color: #00bfff;">{</span>
    <span style="color: #729fcf; font-weight: bold;">var</span> <span style="color: #f57900; font-weight: bold;">xs</span> <span style="color: #729fcf; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">Vector</span><span style="color: #ffa500;">[</span><span style="color: #8ae234; font-weight: bold;">Tuple2</span><span style="color: #ff7f50;">[</span><span style="color: #8ae234; font-weight: bold;">Int</span>, <span style="color: #8ae234; font-weight: bold;">Int</span><span style="color: #ff7f50;">]</span><span style="color: #ffa500;">]()</span>
    <span style="color: #729fcf; font-weight: bold;">var</span> <span style="color: #f57900; font-weight: bold;">cur</span> <span style="color: #729fcf; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">0</span>
    <span style="color: #729fcf; font-weight: bold;">var</span> <span style="color: #f57900; font-weight: bold;">n</span> <span style="color: #729fcf; font-weight: bold;">=</span> m
    <span style="color: #729fcf; font-weight: bold;">var</span> <span style="color: #f57900; font-weight: bold;">i</span> <span style="color: #729fcf; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">2</span>
    <span style="color: #729fcf; font-weight: bold;">while</span><span style="color: #ffa500;">(</span>n &gt; i<span style="color: #ffa500;">)</span> <span style="color: #ffa500;">{</span>
      <span style="color: #729fcf; font-weight: bold;">if</span><span style="color: #ff7f50;">(</span>n % i == <span style="color: #8ae234; font-weight: bold;">0</span> &amp;&amp; isPrime<span style="color: #00ff00;">(</span>i<span style="color: #00ff00;">)</span><span style="color: #ff7f50;">)</span> <span style="color: #ff7f50;">{</span>
        cur <span style="color: #729fcf; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">0</span>
        <span style="color: #729fcf; font-weight: bold;">while</span><span style="color: #00ff00;">(</span>n % i == <span style="color: #8ae234; font-weight: bold;">0</span><span style="color: #00ff00;">)</span> <span style="color: #00ff00;">{</span>cur += <span style="color: #8ae234; font-weight: bold;">1</span>; n /= i<span style="color: #00ff00;">}</span>
        <span style="color: #729fcf; font-weight: bold;">if</span><span style="color: #00ff00;">(</span>cur != <span style="color: #8ae234; font-weight: bold;">0</span><span style="color: #00ff00;">)</span> xs <span style="color: #729fcf; font-weight: bold;">=</span> xs :+ <span style="color: #00ff00;">(</span>i, cur<span style="color: #00ff00;">)</span>
      <span style="color: #ff7f50;">}</span>
      i += <span style="color: #8ae234; font-weight: bold;">1</span>
    <span style="color: #ffa500;">}</span>
    xs <span style="color: #729fcf; font-weight: bold;">=</span> xs :+ <span style="color: #ffa500;">(</span>n, <span style="color: #8ae234; font-weight: bold;">1</span><span style="color: #ffa500;">)</span>
    xs.map<span style="color: #ffa500;">{</span> <span style="color: #729fcf; font-weight: bold;">case</span> <span style="color: #ff7f50;">(</span><span style="color: #ff6347; font-weight: bold;">i</span>, <span style="color: #ff6347; font-weight: bold;">c</span><span style="color: #ff7f50;">)</span> <span style="color: #729fcf; font-weight: bold;">=&gt;</span>
      <span style="color: #729fcf; font-weight: bold;">if</span><span style="color: #ff7f50;">(</span>c == <span style="color: #8ae234; font-weight: bold;">1</span><span style="color: #ff7f50;">)</span> <span style="color: #ad7fa8; font-style: italic;">"("</span>+ i +<span style="color: #ad7fa8; font-style: italic;">")"</span>
      <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #ad7fa8; font-style: italic;">"("</span>+ i + <span style="color: #ad7fa8; font-style: italic;">"**"</span> + c + <span style="color: #ad7fa8; font-style: italic;">")"</span>
    <span style="color: #ffa500;">}</span>.mkString<span style="color: #ffa500;">(</span><span style="color: #ad7fa8; font-style: italic;">""</span><span style="color: #ffa500;">)</span>
  <span style="color: #00bfff;">}</span>
<span style="color: #ffd700;">}</span>
</pre>
</div>
<p>
It looks really wordy&#x2026;
</p>
</div>
</div>

<div id="outline-container-org7c0beb2" class="outline-3">
<h3 id="org7c0beb2"><span class="section-number-3">2.2</span> Moving forward</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Let's try to be more functional&#x2026;
</p>
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #729fcf; font-weight: bold;">object</span> <span style="color: #8ae234; font-weight: bold;">PrimeDecomp</span> <span style="color: #ffd700;">{</span>

  <span style="color: #729fcf; font-weight: bold;">def</span> <span style="color: #edd400; font-weight: bold;">factors</span><span style="color: #00bfff;">(</span>m<span style="color: #729fcf; font-weight: bold;">:</span> <span style="color: #8ae234; font-weight: bold;">Int</span><span style="color: #00bfff;">)</span><span style="color: #729fcf; font-weight: bold;">:</span> <span style="color: #8ae234; font-weight: bold;">String</span> <span style="color: #729fcf; font-weight: bold;">=</span> <span style="color: #8ae234; font-weight: bold;">Iterator</span>
    .iterate<span style="color: #00bfff;">(</span><span style="color: #ffa500;">(</span><span style="color: #8ae234; font-weight: bold;">List</span><span style="color: #ff7f50;">[</span><span style="color: #8ae234; font-weight: bold;">Int</span><span style="color: #ff7f50;">]()</span>, m, <span style="color: #8ae234; font-weight: bold;">2</span><span style="color: #ffa500;">)</span><span style="color: #00bfff;">)</span> <span style="color: #00bfff;">{</span>
      <span style="color: #729fcf; font-weight: bold;">case</span> <span style="color: #ffa500;">(</span><span style="color: #ff6347; font-weight: bold;">acc</span>, <span style="color: #ff6347; font-weight: bold;">x</span>, <span style="color: #ff6347; font-weight: bold;">a</span><span style="color: #ffa500;">)</span> <span style="color: #729fcf; font-weight: bold;">if</span> x % a == <span style="color: #8ae234; font-weight: bold;">0</span> <span style="color: #729fcf; font-weight: bold;">=&gt;</span> <span style="color: #ffa500;">(</span>a :: acc, x/a, a<span style="color: #ffa500;">)</span>
      <span style="color: #729fcf; font-weight: bold;">case</span> <span style="color: #ffa500;">(</span><span style="color: #ff6347; font-weight: bold;">acc</span>, <span style="color: #ff6347; font-weight: bold;">x</span>, <span style="color: #ff6347; font-weight: bold;">a</span><span style="color: #ffa500;">)</span> <span style="color: #729fcf; font-weight: bold;">if</span> a * a &lt;= x <span style="color: #729fcf; font-weight: bold;">=&gt;</span> <span style="color: #ffa500;">(</span>acc, x, a+<span style="color: #8ae234; font-weight: bold;">1</span><span style="color: #ffa500;">)</span>
      <span style="color: #729fcf; font-weight: bold;">case</span> <span style="color: #ffa500;">(</span><span style="color: #ff6347; font-weight: bold;">acc</span>, <span style="color: #ff6347; font-weight: bold;">x</span>, <span style="color: #ff6347; font-weight: bold;">a</span><span style="color: #ffa500;">)</span>               <span style="color: #729fcf; font-weight: bold;">=&gt;</span> <span style="color: #ffa500;">(</span>x :: acc, x, a<span style="color: #ffa500;">)</span>
    <span style="color: #00bfff;">}</span>
    .dropWhile <span style="color: #00bfff;">{</span> <span style="color: #729fcf; font-weight: bold;">case</span> <span style="color: #ffa500;">(</span><span style="color: #729fcf; font-weight: bold;">_</span>, <span style="color: #ff6347; font-weight: bold;">x</span>, <span style="color: #ff6347; font-weight: bold;">a</span><span style="color: #ffa500;">)</span> <span style="color: #729fcf; font-weight: bold;">=&gt;</span> a*a &lt;= x <span style="color: #00bfff;">}</span>.drop<span style="color: #00bfff;">(</span><span style="color: #8ae234; font-weight: bold;">1</span><span style="color: #00bfff;">)</span>.next._1
    .groupMapReduce<span style="color: #00bfff;">(</span>identity<span style="color: #00bfff;">)(</span><span style="color: #729fcf; font-weight: bold;">_</span> <span style="color: #729fcf; font-weight: bold;">=&gt;</span> <span style="color: #8ae234; font-weight: bold;">1</span><span style="color: #00bfff;">)(</span><span style="color: #729fcf; font-weight: bold;">_</span> + <span style="color: #729fcf; font-weight: bold;">_</span><span style="color: #00bfff;">)</span>
    .toSeq.sorted
    .map <span style="color: #00bfff;">{</span>
      <span style="color: #729fcf; font-weight: bold;">case</span> <span style="color: #ffa500;">(</span><span style="color: #ff6347; font-weight: bold;">factor</span>, <span style="color: #8ae234; font-weight: bold;">1</span><span style="color: #ffa500;">)</span>     <span style="color: #729fcf; font-weight: bold;">=&gt;</span> s<span style="color: #ad7fa8; font-style: italic;">"(</span><span style="color: #ff6347; font-weight: bold;">$factor</span><span style="color: #ad7fa8; font-style: italic;">)"</span>
      <span style="color: #729fcf; font-weight: bold;">case</span> <span style="color: #ffa500;">(</span><span style="color: #ff6347; font-weight: bold;">factor</span>, <span style="color: #ff6347; font-weight: bold;">count</span><span style="color: #ffa500;">)</span> <span style="color: #729fcf; font-weight: bold;">=&gt;</span> s<span style="color: #ad7fa8; font-style: italic;">"(</span><span style="color: #ff6347; font-weight: bold;">$factor</span><span style="color: #ad7fa8; font-style: italic;">**</span><span style="color: #ff6347; font-weight: bold;">$count</span><span style="color: #ad7fa8; font-style: italic;">)"</span>
    <span style="color: #00bfff;">}</span>
    .mkString
<span style="color: #ffd700;">}</span>
</pre>
</div>
<p>
Well, basically, this version is just the same algorithm compared with imperative one.
</p>

<p>
Let's translate the algorithm to <span class="underline">Haskell</span> version to make things a bit more clear.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #edd400; font-weight: bold;">factorize</span> n <span style="color: #ff6347; font-weight: bold;">=</span> divs n primesList <span style="color: #729fcf; font-weight: bold;">where</span>
  divs n ds<span style="color: #ff6347; font-weight: bold;">@</span><span style="color: #ffd700;">(</span>d<span style="color: #8ae234; font-weight: bold;">:</span>t<span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">|</span> d<span style="color: #ff6347; font-weight: bold;">*</span>d <span style="color: #ff6347; font-weight: bold;">&gt;</span> n    <span style="color: #ff6347; font-weight: bold;">=</span> <span style="color: #ffd700;">[</span>n <span style="color: #ff6347; font-weight: bold;">|</span> n <span style="color: #ff6347; font-weight: bold;">&gt;</span> 1<span style="color: #ffd700;">]</span>
                  <span style="color: #ff6347; font-weight: bold;">|</span> r <span style="color: #ff6347; font-weight: bold;">==</span> 0     <span style="color: #ff6347; font-weight: bold;">=</span>  d <span style="color: #8ae234; font-weight: bold;">:</span> divs q ds
                  <span style="color: #ff6347; font-weight: bold;">|</span> otherwise  <span style="color: #ff6347; font-weight: bold;">=</span>      divs n t
    <span style="color: #729fcf; font-weight: bold;">where</span>  <span style="color: #ffd700;">(</span>q, r<span style="color: #ffd700;">)</span> <span style="color: #ff6347; font-weight: bold;">=</span> quotRem n d
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdd34a4e" class="outline-2">
<h2 id="orgdd34a4e"><span class="section-number-2">3</span> Generating list of primes</h2>
<div class="outline-text-2" id="text-3">
<p>
It looks the basic algorithm is simple, but that's not the end of our journey.
</p>
</div>

<div id="outline-container-orgb31f17c" class="outline-3">
<h3 id="orgb31f17c"><span class="section-number-3">3.1</span> A puzzle</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #729fcf;">lazy</span> <span style="color: #729fcf; font-weight: bold;">val</span> <span style="color: #ff6347; font-weight: bold;">ps</span><span style="color: #729fcf; font-weight: bold;">:</span> <span style="color: #8ae234; font-weight: bold;">Stream</span><span style="color: #ffd700;">[</span><span style="color: #8ae234; font-weight: bold;">Int</span><span style="color: #ffd700;">]</span> <span style="color: #729fcf; font-weight: bold;">=</span> 
  <span style="color: #8ae234; font-weight: bold;">2</span> #:: <span style="color: #8ae234; font-weight: bold;">Stream</span>.from<span style="color: #ffd700;">(</span><span style="color: #8ae234; font-weight: bold;">3</span><span style="color: #ffd700;">)</span>.filter<span style="color: #ffd700;">(</span>i <span style="color: #729fcf; font-weight: bold;">=&gt;</span> ps.takeWhile<span style="color: #00bfff;">{</span>j <span style="color: #729fcf; font-weight: bold;">=&gt;</span> j * j &lt;= i<span style="color: #00bfff;">}</span>.forall<span style="color: #00bfff;">{</span>k <span style="color: #729fcf; font-weight: bold;">=&gt;</span> i % k &gt; <span style="color: #8ae234; font-weight: bold;">0</span><span style="color: #00bfff;">}</span><span style="color: #ffd700;">)</span>
</pre>
</div>
<p>
This is a lazy list which can be used to generate prime numbers.
How does this work?
</p>

<p>
The definition starts out with 2 #:: &#x2026;. This just says that the first number in the sequence is 2 - simple enough so far.
</p>

<p>
The next part defines the rest of the prime numbers. 
We can start with all the counting numbers starting at 3 (Stream.from(3)), 
but we obviously need to filter a bunch of these numbers out (i.e., all the composites). 
</p>

<p>
So let's consider each number i. 
If i is not a multiple of a lesser prime number, then i is prime. 
That is, i is prime if, for all primes k less than i, i % k &gt; 0. 
In Scala, we could express this as
</p>
<div class="org-src-container">
<pre class="src src-scala">nums.filter<span style="color: #ffd700;">(</span>i <span style="color: #729fcf; font-weight: bold;">=&gt;</span> ps.takeWhile<span style="color: #00bfff;">(</span>k <span style="color: #729fcf; font-weight: bold;">=&gt;</span> k &lt; i<span style="color: #00bfff;">)</span>.forall<span style="color: #00bfff;">(</span>k <span style="color: #729fcf; font-weight: bold;">=&gt;</span> i % k &gt; <span style="color: #8ae234; font-weight: bold;">0</span><span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<p>
However, it isn't actually necessary to check all lesser prime numbers &#x2013; 
we really only need to check the prime numbers whose 
square is less than or equal to i (this is a fact from number theory*). 
So we could instead write
</p>
<div class="org-src-container">
<pre class="src src-scala">nums.filter<span style="color: #ffd700;">(</span>i <span style="color: #729fcf; font-weight: bold;">=&gt;</span> ps.takeWhile<span style="color: #00bfff;">(</span>k <span style="color: #729fcf; font-weight: bold;">=&gt;</span> k * k &lt;= i<span style="color: #00bfff;">)</span>.forall<span style="color: #00bfff;">(</span>k <span style="color: #729fcf; font-weight: bold;">=&gt;</span> i % k &gt; <span style="color: #8ae234; font-weight: bold;">0</span><span style="color: #00bfff;">)</span><span style="color: #ffd700;">)</span>
</pre>
</div>

<p>
Finally we get our definition.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Comcx</p>
<p class="date">Created: 2020-02-24 周一 17:53</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
